PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/audio_codec.c
  /* USER CODE END SPI1_MspInit 0 */
  /* Peripheral clock enable */
  __SPI1_CLK_ENABLE();
  __GPIOA_CLK_ENABLE();
  __GPIOC_CLK_ENABLE();

  /**I2S1 GPIO Configuration    
    PA4     ------> I2S1_WS --> LRCKO
    PA5     ------> I2S1_CK --> BICKO
    PA7     ------> I2S1_SD --> SDO12
    PC4     ------> I2S1_MCK
    */
	GPIO_InitStruct.Pin =  GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_7;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    //GPIO_InitStruct.Pin = GPIO_PIN_4;
    //GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    //GPIO_InitStruct.Pull = GPIO_NOPULL;
    //GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    //GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
    //HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	
  /* Peripheral interrupt init*/
    HAL_NVIC_SetPriority(SPI1_IRQn, INTERRUPT_PRI_SDO12, 0);
    HAL_NVIC_EnableIRQ(SPI1_IRQn);
  /* USER CODE BEGIN SPI1_MspInit 1 */

  /* USER CODE END SPI1_MspInit 1 */
  }
  else if(hi2s->Instance==SPI2)
  {
	  /* USER CODE BEGIN SPI2_MspInit 0 */
	  
	  /* USER CODE END SPI2_MspInit 0 */
		/* Peripheral clock enable */
		__SPI2_CLK_ENABLE();
		__GPIOI_CLK_ENABLE();
		__GPIOB_CLK_ENABLE();
		__GPIOC_CLK_ENABLE();
	  
		/**I2S2 GPIO Configuration	   
		PC1 	------> I2S2_SD  : PI3 PC1 PC3 PB15 	
		PB13	 ------> I2S2_CK :PD3 PB10 PB13 PA9 PI1 
		PB12	 ------> I2S2_WS : PB12 PI0 PB4 PB9  
	  
	  
		*/
		GPIO_InitStruct.Pin = GPIO_PIN_1; //SD
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
		HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	  
		GPIO_InitStruct.Pin = GPIO_PIN_12|GPIO_PIN_13;//WS --> GPIO_PIN_12
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
		HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
	  
	  
		/* Peripheral interrupt init*/
		HAL_NVIC_SetPriority(SPI2_IRQn, INTERRUPT_PRI_SDO34, 0);
		HAL_NVIC_EnableIRQ(SPI2_IRQn);
		/* USER CODE BEGIN SPI2_MspInit 1 */
	  
	  /* USER CODE END SPI2_MspInit 1 */

  }
  else if(hi2s->Instance==SPI3)
  {


  
    /**I2S3 GPIO Configuration    
       PB2     ------> I2S3_SD
       PA15     ------> I2S3_WS (LRCK)
       PB3     ------> I2S3_CK 
	 PC7    ------> MCLK
    */
 
  /* USER CODE BEGIN SPI3_MspInit 1 */
  __SPI3_CLK_ENABLE();
  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();
  __GPIOC_CLK_ENABLE();
  GPIO_InitStructure.Pin = GPIO_PIN_3; 
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Alternate = GPIO_AF6_SPI3;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_2; 
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Alternate = GPIO_AF7_SPI3;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);


  GPIO_InitStructure.Pin = GPIO_PIN_15;
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Alternate = GPIO_AF6_SPI3;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);


   
#ifdef CODEC_MCLK_ENABLED

  GPIO_InitStructure.Pin = GPIO_PIN_7; 
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Alternate = GPIO_AF6_SPI3;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

#endif /* CODEC_MCLK_ENABLED */ 

#ifdef I2S_INTERRUPT   
     /* Enable and set Button EXTI Interrupt to the lowest priority */
     //HAL_NVIC_SetPriority((IRQn_Type)SPI3_IRQn, 0x00, 0x01);
     //HAL_NVIC_EnableIRQ((IRQn_Type)SPI3_IRQn);

     /* Enable the I2S DMA request */
     //__HAL_I2S_ENABLE_IT(&hi2s3, SPI_I2S_DMAReq_Tx);
     //__HAL_I2S_ENABLE(&hi2s3);
  	    /* Peripheral interrupt init*/
		HAL_NVIC_SetPriority(SPI3_IRQn, INTERRUPT_PRI_AUDIOOUT, 0);
		HAL_NVIC_EnableIRQ(SPI3_IRQn);
#endif

      /* Enable the DMA clock */ 
	  __HAL_RCC_DMA1_CLK_ENABLE();

      /* Configure the DMA Stream */
      //HAL_DMA_DeInit(&DmaHandle);

      /* Set the parameters to be configured */ 
	  DmaHandle.Instance = DMA1_Stream7;
      DmaHandle.Init.Channel = DMA_CHANNEL_0;
	  DmaHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
	  DmaHandle.Init.PeriphInc = DMA_PINC_DISABLE;
	  DmaHandle.Init.MemInc = DMA_MINC_ENABLE;
	  DmaHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      DmaHandle.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD; 
	  DmaHandle.Init.Mode = DMA_NORMAL;
      DmaHandle.Init.Priority = DMA_PRIORITY_HIGH; 
	  DmaHandle.Init.FIFOMode = DMA_FIFOMODE_ENABLE;//DMA_FIFOMODE_DISABLE
      DmaHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
      DmaHandle.Init.MemBurst = DMA_MBURST_SINGLE;
      DmaHandle.Init.PeriphBurst = DMA_PBURST_SINGLE;	  
      DmaHandle.Instance->PAR =(uint32_t)&SPI3->DR;//CODEC_I2S_ADDRESS
      //DmaHandle.Instance->M0AR = (uint32_t)0;
      //DmaHandle.Instance->NDTR = (uint32_t)0xFFFE;
      //DmaHandle.XferCpltCallback = &TC_Callback;
 

      /* Associate the initialized DMA handle to the the SPI handle */
      __HAL_LINKDMA(hi2s, hdmatx, DmaHandle);
      //__HAL_DMA_ENABLE_IT(&DmaHandle, DMA_IT_TC);

	   /* Deinitialize the Stream for new transfer */
       HAL_DMA_DeInit(&DmaHandle);
       /* Configure the DMA Stream */
	   HAL_DMA_Init(&DmaHandle);

      __HAL_I2S_ENABLE(&hi2s3);

      /* Set Interrupt Group Priority */
      HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, 2, 1);
      /* Enable the DMA STREAM global Interrupt */
      HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);    

 }

}

void HAL_SPI_MspDeInit(SPI_HandleTypeDef *hspi)
{
  if(hspi->Instance == SPI3)
  {   
    /*##-1- Reset peripherals ##################################################*/
    __HAL_RCC_SPI3_FORCE_RESET();
    __HAL_RCC_SPI3_RELEASE_RESET();

    /*##-2- Disable peripherals and GPIO Clocks ################################*/
    HAL_GPIO_DeInit(CODEC_I2S_GPIO, CODEC_I2S_SCK_PIN);
    HAL_GPIO_DeInit(CODEC_I2S_GPIO, CODEC_I2S_SD_PIN);
    HAL_GPIO_DeInit(CODEC_I2S_WS_GPIO, CODEC_I2S_WS_PIN);
	HAL_GPIO_DeInit(CODEC_I2S_MCK_GPIO, CODEC_I2S_MCK_PIN);

    /*##-3- Disable the DMA ####################################################*/
    /* De-Initialize the DMA associated to transmission process */
    HAL_DMA_DeInit(&DmaHandle);


    /*##-4- Disable the NVIC for DMA ###########################################*/
    HAL_NVIC_DisableIRQ(DMA1_Stream7_IRQn);
  }
}


void HAL_I2C_MspDeInit(I2C_HandleTypeDef *hi2c)
{
    /*##-1- Reset peripherals ##################################################*/
    __HAL_RCC_I2C1_FORCE_RESET();
    __HAL_RCC_I2C1_RELEASE_RESET();


  /*##-2- Disable peripherals and GPIO Clocks #################################*/
  /* Configure I2C Tx as alternate function  */
  HAL_GPIO_DeInit(CODEC_I2C_GPIO, CODEC_I2C_SCL_PIN);
  /* Configure I2C Rx as alternate function  */
  HAL_GPIO_DeInit(CODEC_I2C_GPIO, CODEC_I2C_SDA_PIN);
}



 /* I2C1 init function */
void MX_I2C1_Init(void)
{


  hi2c1.Instance = I2C1;
  hi2c1.Init.Timing =0x00A0689A;           //I2C_SPEED DISCOVERY_I2Cx_TIMING; 0x00C0EFFF
                                           //I2C_TIMING ;//I2C_TIMING  0x00303D5D
                                           //DISCOVERY_I2Cx_TIMING
  hi2c1.Init.OwnAddress1 = 0x33;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  HAL_I2C_Init(&hi2c1);

   /*Configure Analogue filter */
  HAL_I2CEx_AnalogFilter_Config(&hi2c1, I2C_ANALOGFILTER_ENABLE);

}

